# 17. Дан список чисел. Определите, сколько в нем встречается различных чисел.
my_list = [1, 2, 3, 2, 4, 3, 5, 5, 6]
set_from_my_list = set(my_list)
print(len(set_from_my_list))
